Охотники_и_рыболовы/src/Documents/УстановкаОграниченийИЦен/УстановкаОграниченийИЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОграниченийИЦен</name>
  <registerRecords>InformationRegister.ЦеныПоВидамДичи</registerRecords>
  <registerRecords>InformationRegister.ОграниченияДичиНаДобычу</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Общая</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСвоимРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСвоимСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧужимРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧужимСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоГосБилетРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоГосБилетСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеОсобыхЦен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоСезонная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.ГруппыДичи</types>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ограничено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаСезон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/УстановкаОграниченийИЦен/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если ТекущийСезон.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен сезон охоты.");
		Отказ = Истина;
	ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
		Объект.СезонОхоты = ТекущийСезон;
	КонецЕсли;
	
	ДатаНачалаСезона = ТекущийСезон.ДатаНачала;
	ДатаОкончанияСезона = ТекущийСезон.ДатаОкончания;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДичи.Ссылка КАК ВидДичи,
		|	ПРЕДСТАВЛЕНИЕ(ВидыДичи.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.ВидыДичи КАК ВидыДичи
		|ГДЕ
		|	НЕ ВидыДичи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыДичи.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВидовДичи.Добавить(Выборка.ВидДичи,Выборка.Представление);
	КонецЦикла;
	
	
	                                                          
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ОбщаяДатаНачала.Подсказка = "Дата начала должна быть не раньше чем " + Формат(ДатаНачалаСезона,"ДЛФ=DD");
	Элементы.ОбщаяДатаОкончания.Подсказка = "Дата окончания должна быть не позже чем " + Формат(ДатаОкончанияСезона,"ДЛФ=DD");
КонецПроцедуры


/////////////////////////////////////////

#Область ТабличнаяЧастьОбщая
&НаКлиенте
Процедура ОбщаяПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Отказ = НайтиДублиСтрок();
	
	Если Отказ  Тогда
		Текст = "Есть полные дубли строк. Уточните данные";
		Поле =  "Объект.Общая"; //[" + Строка((Элемент.ТекущаяСтрока - 1)) + "].ВидДичи" ;	
		СообщитьНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;	
	
	Если ПроверитьДаты(Элемент,Объект.Общая) Тогда
		ТекстВопроса = "Не заполнены обязательные поля. Удалить строку?";
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса",Элемент);
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДичи) 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаНачала)
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаОкончания) Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.КлючСвязи) Тогда
			Элемент.ТекущиеДанные.КлючСвязи = Новый УникальныйИдентификатор();
		КонецЕсли;	
	Иначе
		ПустаяСтрока = Истина;
		ТекстВопроса = "Не заполнены обязательные поля. Удалить строку?";
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса",Элемент);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбщаяПередУдалением(Элемент, Отказ)
	КлючСвязи = Элемент.ТекущиеДанные.КлючСвязи;
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		Строки = Объект.Состав.НайтиСтроки(Новый Структура("КлючСвязи",КлючСвязи));
		Если НЕ Строки.Количество() = 0 Тогда
			Описание = Новый ОписаниеОповещения("ОбщаяПередУдалениемЗавершение",ЭтаФорма,Строки);
			ПоказатьВопрос(Описание,"Есть связанные объекты?
									|Удалить?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
			Отказ = Истина;						
			Возврат;									
		КонецЕсли;
	КонецЕсли;
	Если Не Отказ Тогда
		Если НельзяДобавитьСтроку Тогда
			НельзяДобавитьСтроку = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПередУдалениемЗавершение(РезультатВопроса,Строки) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	КлючСвязи = Строки[0].КлючСвязи;
	Строка = Объект.Общая.НайтиСтроки(Новый Структура("КлючСвязи",КлючСвязи))[0];
	Объект.Общая.Удалить(Объект.Общая.Индекс(Строка));	
	
	Для каждого стр из Строки Цикл
		Объект.Состав.Удалить(Объект.Состав.Индекс(стр));	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяВидДичиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокВыбора = Элементы.ОбщаяВидДичи.СписокВыбора;	//
	СписокВыбора.ЗагрузитьЗначения(СписокВидовДичи.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НельзяДобавитьСтроку Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Копирование Тогда
		Отказ = Истина;
		ВидДичи = Элемент.ТекущиеДанные.ВидДичи;
		Строки = Объект.Общая.НайтиСтроки(Новый Структура("ВидДичи",ВидДичи));
		
		Строка = Строки[0];
		
		ДобавляемаяСтрока = Объект.Общая.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавляемаяСтрока,Строка,,"ДатаНачала,ДатаОкончания,КлючСвязи");
		Элементы.Общая.ТекущаяСтрока = ДобавляемаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ОбщаяДатаНачала = '00010101';
		ОбщаяДатаОкончания = '00010101';
		Возврат;
	КонецЕсли;	
	ОбщаяДатаНачала = Элемент.ТекущиеДанные.ДатаНачала;
	ОбщаяДатаОкончания = Элемент.ТекущиеДанные.ДатаОкончания;
	Элементы.Состав.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСвязи",Элемент.ТекущиеДанные.КлючСвязи));
КонецПроцедуры


&НаКлиенте
Процедура ОбщаяДатаНачалаПриИзменении(Элемент)
	Если НЕ Элемент.Родитель.ТекущиеДанные = Неопределено
			И Элемент.Родитель.ТекущиеДанные.ДатаНачала < ДатаНачалаСезона Тогда
		стр = Объект.Общая.Получить(Элементы.Общая.ТекущаяСтрока - 1);
		стр.ДатаНачала = ДатаНачалаСезона;
		СообщитьНаСервере("Дата начала была изменена","Общая.ДатаНачала");
	ОбщаяДатаНачала = стр.ДатаНачала;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяДатаОкончанияПриИзменении(Элемент)
	Если НЕ Элемент.Родитель.ТекущиеДанные = Неопределено
			И Элемент.Родитель.ТекущиеДанные.ДатаОкончания > ДатаОкончанияСезона Тогда
		стр = Объект.Общая.Получить(Элементы.Общая.ТекущаяСтрока - 1);
		стр.ДатаОкончания = ДатаОкончанияСезона;
		СообщитьНаСервере("Дата окончания была изменена","Общая.ДатаОкончания");
		ОбщаяДатаОкончания = стр.ДатаОкончания;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти

//////////////////////////////////////


#Область ТабличнаяЧастьСостав

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтрока = ТекСтрока();
	Если ТекСтрока = Неопределено Тогда
		Отказ = Истина;
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КлючСвязи) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ПроверитьДаты(Элемент,Объект.Состав) Тогда
		ТекстВопроса = "Не заполнены обязательные поля. Удалить строку?";
		
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса",Элемент);
		Возврат;
	КонецЕсли;	
	Если НЕ  (ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дичь) 
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаНачала)
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаОкончания))  Тогда
		
		ТекстВопроса = "Не заполнены обязательные поля. Удалить строку?";
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса",Элемент);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппаПриИзменении(Элемент)
	ОграничитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ТекСтрока());
		Элементы.СоставДатаНачала.МинимальноеЗначение =  Элемент.ТекущиеДанные.ДатаНачала;
		Элементы.СоставДатаОкончания.МаксимальноеЗначение = Элемент.ТекущиеДанные.ДатаОкончания;
		
	КонецЕсли;	
	ОграничитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьСписокВыбора()
	Элементы.СоставДичь.СписокВыбора.Очистить();
	Группа = Элементы.Состав.ТекущиеДанные.Группа;
	
	Если Группа Тогда
		Элементы.СоставДичь.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ГруппыДичи");
	Иначе	
		Элементы.СоставДичь.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Дичь");
	КонецЕсли;
	
	СписокДичи = ПолучитьСписокДичиНаСервере(ТекСтрока().ВидДичи,Элементы.Состав.ТекущиеДанные.Группа);
	ОбновитьПовторноИспользуемыеЗначения();
	
	
	Элементы.СоставДичь.СписокВыбора.ЗагрузитьЗначения(СписокДичи.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура СоставОграниченоПриИзменении(Элемент)
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если НЕ ТекДанные.Ограничено Тогда
		ТекДанные.КоличествоВДень = 0;
		ТекДанные.КоличествоЗаСезон = 0;
	КонецЕсли;
	
	УстановитьДоступностьКолонокКоличество(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставДатаНачалаПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекСтрока.ДатаНачала < ОбщаяДатаНачала ИЛИ ТекСтрока.ДатаНачала > ОбщаяДатаОкончания Тогда
		ТекСтрока.ДатаНачала = ОбщаяДатаНачала;
		СообщитьНаСервере("Дата начала была изменена","Состав.ДатаНачала");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставДатаОкончанияПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекСтрока.ДатаОкончания < ОбщаяДатаНачала ИЛИ ТекСтрока.ДатаОкончания > ОбщаяДатаОкончания Тогда
		ТекСтрока.ДатаНачала = ОбщаяДатаОкончания;
		СообщитьНаСервере("Дата окончания была изменена","Состав.ДатаОкончания");
	КонецЕсли;	

КонецПроцедуры


#КонецОбласти

////////////////////////////////////

#Область Вспомогательные

&НаКлиенте
Функция ПроверитьДаты(Элемент,ТабличнаяЧасть) Экспорт
	Отказ = Ложь;
	
	ОтборПоКлючуСвязи = Новый Структура("КлючСвязи",Элемент.ТекущиеДанные.КлючСвязи);
	НайдСтроки = ТабличнаяЧасть.НайтиСтроки(ОтборПоКлючуСвязи);
	
	Если НайдСтроки.Количество() > 1 Тогда
		Для инд = 1 по НайдСтроки.Количество() - 1 Цикл
			СтрокаОбщая = НайдСтроки[инд];
			
			ИскСтроки = Объект.Состав.НайтиСтроки(ОтборПоКлючуСвязи);
			Если ИскСтроки.Количество() > 1 Тогда
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
	НомерСтроки = НайдСтроки[0].НомерСтроки;
	
	ДатаНачала = ТабличнаяЧасть[НомерСтроки - 1].ДатаНачала;
	ДатаОкончания = ТабличнаяЧасть[НомерСтроки -  1].ДатаОкончания;
	
	ТекСтрокаОбщая = ТекСтрока();
	
	Если Элемент.Имя = "Общая" Тогда
		ДатаСравненияНачала = ДатаНачалаСезона;
		ДатаСравненияОкончания = ДатаОкончанияСезона;
		
		Поле =  "Объект.Общая"; //[" + Строка((Элемент.ТекущаяСтрока - 1)) + "].ВидДичи" ;
	Иначе
		ДатаСравненияНачала = ДатаНачалаСезона;
		ДатаСравненияОкончания = ДатаОкончанияСезона;
		
		Поле = 	"Объект.Состав"; //[" + Строка((Элемент.ТекущаяСтрока - 1)) + "].Дичь" ;
	КонецЕсли;
	

	Если  ДатаНачала = '00010101' Тогда
		Возврат Истина;
	ИначеЕсли	ДатаОкончания = '00010101' Тогда
		Возврат Истина;
	ИначеЕсли 	ДатаНачала <  ДатаСравненияНачала Тогда
		Текст = "Некорректная дата начала";
	ИначеЕсли 	ДатаНачала > ДатаОкончания Тогда
		Текст = "Некорректная дата начала или дата окончания";
	ИначеЕсли 	ДатаОкончания >  ДатаСравненияОкончания Тогда
		Текст = "Некорректная дата окончания";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		Отказ = Истина;
		СообщитьНаСервере(Текст, Поле );
	КонецЕсли;
	Возврат Отказ;
КонецФункции

&НаКлиенте
Процедура СоздатьОповещение(ТекстВопроса,ПроцедураОбработки,Элемент) 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения(ПроцедураОбработки, ЭтаФорма, Элемент);
	ПоказатьВопрос(Оповещение,ТекстВопроса , Режим, 0);

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопроса(Результат, Элемент) Экспорт
	ИмяТабличнойЧасти = Элемент.Имя;
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Если Элемент.Имя = "Общая" Тогда
			НельзяДобавитьСтроку = Истина;
		КонецЕсли;	
		Возврат;		                               
	Иначе
		Отказ = Ложь;
		     ///// проверим возможность удаления в таблице общая
		Если ИмяТабличнойЧасти = "Общая" Тогда
			ОбщаяПередУдалением(Элемент,Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда 
			Объект[ИмяТабличнойЧасти].Удалить(Элемент.ТекущиеДанные.НомерСтроки-1);
			НельзяДобавитьСтроку = Ложь;
		Иначе
			Элементы.Общая.ТекущийЭлемент = Элемент;//установим фокус обратно
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДичиНаСервере(ТекВидДичи,Группа)
	Возврат ОхотаСерверПовтИсп.ПолучитьСписокДичи(ТекВидДичи,Группа);
КонецФункции

&НаКлиенте
Функция ТекСтрока()
	ТекСтрока = Элементы.Общая.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат  ТекСтрока;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция НайтиДублиСтрок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧасть.ВидДичи,
		|	ТабЧасть.ДатаНачала,
		|	ТабЧасть.ДатаОкончания,
		|	1 КАК Поле1
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	&ТабЧасть КАК ТабЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ1.ВидДичи,
		|	ВТ1.ДатаНачала,
		|	ВТ1.ДатаОкончания,
		|	СУММА(ВТ1.Поле1) КАК Поле1
		|ИЗ
		|	ВТ1 КАК ВТ1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ1.ВидДичи,
		|	ВТ1.ДатаНачала,
		|	ВТ1.ДатаОкончания
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ1.Поле1) > 1";
		
	ТабЧасть = Объект.Общая.Выгрузить();	
	Запрос.УстановитьПараметр("ТабЧасть",ТабЧасть);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
		
КонецФункции

&НаСервереБезКонтекста
Процедура СообщитьНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);	
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоВДеньПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные.КоличествоВДень > 0 
		И ТекущиеДанные.КоличествоЗаСезон > 0 Тогда
		ТекущиеДанные.КоличествоЗаСезон = 0;
	КонецЕсли;
	
	СоставОграниченоПриИзменении(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоЗаСезонПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные.КоличествоЗаСезон > 0 
		И ТекущиеДанные.КоличествоВДень > 0 Тогда
		ТекущиеДанные.КоличествоВДень = 0;
	КонецЕсли;	
	СоставОграниченоПриИзменении(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКолонокКоличество(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКолонокКоличество(ТекДанные)
	Если ТекДанные = Неопределено ИЛИ НЕ ТекДанные.Ограничено Тогда
		Элементы.СоставКоличествоВДень.ТолькоПросмотр = Истина;
		Элементы.СоставКоличествоЗаСезон.ТолькоПросмотр = Истина;
	Иначе
		Элементы.СоставКоличествоВДень.ТолькоПросмотр = Ложь;
		Элементы.СоставКоличествоЗаСезон.ТолькоПросмотр = Ложь;
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти
